## Demo SQLite
In this section, we learn how to manipulate data on SQLite.

We cover:
* CRUD operations
* Table to Dataframe

### CRUD - SQLite

In [1]:
import sqlite3
sqlite3.sqlite_version

'3.36.0'

In [2]:
import sqlite3

sqlitedb ='demo.db'
# connect db
conn = sqlite3.connect(sqlitedb) 
conn

In [3]:
# CRUD : Create, Read, Update, Delete
cursor = conn.cursor()

In [4]:
# create a table
sql = ''' create table if not exists employee(
  id integer PRIMARY KEY AUTOINCREMENT,
  full_name char(30) not null,
  age int,
  email char(30)
)'''

cursor.execute(sql)
conn.commit() # commit
print('created a table')

created a table

In [5]:
# create data

cursor.execute(" insert into employee(full_name,age,email) values('employee 1',20,'employee1@email.com')  ")
cursor.execute(" insert into employee(full_name,age,email) values('employee 2',25,'employee2@email.com')  ")
cursor.execute(" insert into employee(full_name,age,email) values('employee 3',27,'employee3@email.com')  ")
cursor.execute(" insert into employee(full_name,age,email) values('employee 4',28,'employee4@email.com')  ")
cursor.execute(" insert into employee(full_name,age,email) values('employee 5',22,'employee5@email.com')  ")
conn.commit() # commit
print('inserted data')

inserted data

In [6]:
# read data
cursor.execute(" select * from employee ")
result = cursor.fetchall() # get all
conn.commit()
result

[(1, 'employee 1', 20, 'employee1@email.com'),
 (2, 'employee 2', 25, 'employee2@email.com'),
 (3, 'employee 3', 27, 'employee3@email.com'),
 (4, 'employee 4', 28, 'employee4@email.com'),
 (5, 'employee 5', 22, 'employee5@email.com')]

In [7]:
# read data
cursor.execute(" select * from employee ")
result = cursor.fetchone() # get one data
conn.commit()
result

(1, 'employee 1', 20, 'employee1@email.com')

In [8]:
# read data
cursor.execute(" select * from employee where age > 25 ")
result = cursor.fetchall() # get all
conn.commit()
result

[(3, 'employee 3', 27, 'employee3@email.com'),
 (4, 'employee 4', 28, 'employee4@email.com')]

In [9]:
# read data
params = (25,)
cursor.execute(" select * from employee where age > ? ", params)
result = cursor.fetchall() # get all
conn.commit()
result

[(3, 'employee 3', 27, 'employee3@email.com'),
 (4, 'employee 4', 28, 'employee4@email.com')]

In [10]:
# Update data
params = (30,'employee2@email.com')
cursor.execute('''
 update employee 
 set age=?
 where email=?
''', params)
conn.commit()

# read data
cursor.execute(" select * from employee ")
result = cursor.fetchall() # get all
conn.commit()
result

[(1, 'employee 1', 20, 'employee1@email.com'),
 (2, 'employee 2', 30, 'employee2@email.com'),
 (3, 'employee 3', 27, 'employee3@email.com'),
 (4, 'employee 4', 28, 'employee4@email.com'),
 (5, 'employee 5', 22, 'employee5@email.com')]

In [11]:
# Delete data
cursor.execute("delete from employee where email='employee4@email.com' ")
conn.commit()

# read data
cursor.execute(" select * from employee ")
result = cursor.fetchall() 
conn.commit()
result

[(1, 'employee 1', 20, 'employee1@email.com'),
 (2, 'employee 2', 30, 'employee2@email.com'),
 (3, 'employee 3', 27, 'employee3@email.com'),
 (5, 'employee 5', 22, 'employee5@email.com')]

## SQLite and Pandas

In [12]:
# load sqlite table to pandas
import pandas as pd

df = pd.read_sql_query("select * from employee", conn)
df

   id   full_name  age                email
0   1  employee 1   20  employee1@email.com
1   2  employee 2   30  employee2@email.com
2   3  employee 3   27  employee3@email.com
3   5  employee 5   22  employee5@email.com

In [13]:
# panda dataframe to table
products = {'name': ['Product A1', 'Product A2', 'Product A3'],           
            'code': ['E01', 'E02', 'E03'],
            'price': [2.1, 3.6, 3.5],
            'quantity': [5, 7, 3],
            'created': ['2020-10-18 20:12:21', '2020-10-18 20:12:21', '2020-10-18 20:12:21']
           }

dataFrame   = pd.DataFrame(data=products) 
dataFrame

         name code  price  quantity              created
0  Product A1  E01    2.1         5  2020-10-18 20:12:21
1  Product A2  E02    3.6         7  2020-10-18 20:12:21
2  Product A3  E03    3.5         3  2020-10-18 20:12:21

In [14]:
# save dataframe to SQLite table
tableName = 'product'
dataFrame.to_sql(tableName, con=conn,index=False, if_exists='append')

In [15]:
# check
df = pd.read_sql('SELECT * FROM product', conn)
df

         name code  price  quantity              created
0  Product A1  E01    2.1         5  2020-10-18 20:12:21
1  Product A2  E02    3.6         7  2020-10-18 20:12:21
2  Product A3  E03    3.5         3  2020-10-18 20:12:21

## Drop Table

In [16]:
# Delete table
cursor.execute("drop table if exists employee ")
conn.commit()
cursor.execute("drop table if exists product ")
conn.commit()